Revit 2026 API

# ToposolidCreateSubDivision(Document, ElementId, IListCurveLoop) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Toposolid CreateSubDivision(
	Document document,
	ElementId topoTypeId,
	IList<CurveLoop> profiles
)
```
```vb
Public Function CreateSubDivision (
	document As Document,
	topoTypeId As ElementId,
	profiles As IList(Of CurveLoop)
) As Toposolid
```
```cpp
public:
Toposolid^ CreateSubDivision(
	Document^ document,
	ElementId^ topoTypeId,
	IList<CurveLoop^>^ profiles
)
```
```fsharp
member CreateSubDivision :
        document : Document *
        topoTypeId : ElementId *
        profiles : IList<CurveLoop> -> Toposolid
```

#### Parameters

document Document

topoTypeId ElementId

profiles IListCurveLoop

#### Return Value

Toposolid

#### Reference

Toposolid Class

CreateSubDivision Overload

Autodesk.Revit.DB Namespace